* WeightPlan : [[https://www.fatsecret.com/Diary.aspx?pa=mdcs][myFatSecretOverview]], [[https://www.fatsecret.com/Default.aspx?pa=memh&id=68900470][myWeightHistory]], target : burn 7000 KC for exercise for each week, 700 per day

** progress and expected plan

     | time         | wk | weight | (pound) | days | expected weight | starting | progress | remark and todo                                |
     |--------------+----+--------+---------+------+-----------------+----------+----------+------------------------------------------------|
     | wk2031(7/27) |  1 |   75.0 |   165.3 |    7 |                 |          | X        |                                                |
     | wk2032(8/03) |  2 |   74.5 | 164.198 |   14 |                 |          | x        |                                                |
     | wk2033(8/10) |  3 |   74.0 | 163.096 |   21 |                 |          | x        |                                                |
     | wk2034(8/17) |  4 |   73.5 | 161.994 |   28 | see 71.5        |     73.0 | on-going | run 1hr per day, push up 100, jump set 30 mins |
     | wk2035(8/24) |  5 |   73.0 | 160.892 |   35 |                 |     74.5 |          |                                                |
     | wk2036(8/31) |  6 |   72.5 |  159.79 |   42 |                 |          |          |                                                |
     | wk2037(9/07) |  7 |   72.0 | 158.688 |   49 |                 |          |          |                                                |

*** TODO : record the TDEE and BMR, and get the estimation of how to lose weight 
**** TODO : BMR : 1550, TDEE : 2387, target intake calorie :: below 1500, muscle weight : 35.5 KG 
**** TODO : TDEE : total daily energy expenditure
**** TODO : come up with work-out plan for 15, 30, 60, 90, 120 mins : 
**** TODO : 120 mins : run 60 mins, power : 60 mins
**** TODO : power 
***** burpee+plank : 12 mins
***** burpee : 6mins
***** jump rope : 30 mins?
***** squart jump + jump rope : ??
***** abs : bring the thing to company?
***** Jump_Stay_in_Air, training
    

  #+TBLFM: $4=$3*2.204::$5=$2*7
** wk2031 Calorie
| wk2031 | total KC | exercise | Balance(b) | Calorie deficit(2387-(b)) | weight |
|--------+----------+----------+------------+---------------------------+--------|
| Mon    |     1666 |      638 |       1028 |                     -1359 |    75. |
| Tu     |     1314 |        0 |       1314 |                     -1073 |        |
| Wed    |     1437 |      649 |        788 |                     -1599 |   74.2 |
| Thu    |     1494 |      584 |        910 |                     -1477 |   74.0 |
| Fri    |     1416 |        0 |       1416 |                      -971 |   74.3 |
| Sat    |     2366 |        0 |       2366 |                       -21 |        |
| Sun    |     1817 |        0 |       1817 |                      -570 |   74.3 |
|--------+----------+----------+------------+---------------------------+--------|
| total  |    11510 |     1871 |       9639 |                     -7070 |        |
#+TBLFM: $4=$2-$3::$5=$4-2387::@9$2..@9$5=vsum(@2..@8)

** wk2032 Calorie
| wk2032 | total KC | exercise | Balance(b) | Calorie deficit(2387-(b)) | weight |
|--------+----------+----------+------------+---------------------------+--------|
| Mon    |      982 |      720 |        262 |                     -2125 |   75.2 |
| Tu     |     1239 |      780 |        459 |                     -1928 |   74.3 |
| Wed    |     1384 |      863 |        521 |                     -1866 |   74.3 |
| Thu    |     1319 |      318 |       1001 |                     -1386 |   72.8 |
| Fri    |     1677 |          |       1677 |                      -710 |   72.3 |
| Sat    |     2219 |      709 |       1510 |                      -877 |     73 |
| Sun    |     2219 |        0 |       2219 |                      -168 |   73.3 |
|--------+----------+----------+------------+---------------------------+--------|
| total  |    11039 |     3390 |       7649 |                     -9060 |        |
#+TBLFM: $4=$2-$3::$5=$4-2387::@9$2..@9$5=vsum(@2..@8)

** wk2033 Calorie 
| wk2033 | total KC | exercise | Balance(b) | Calorie deficit(2387-(b)) | weight |
|--------+----------+----------+------------+---------------------------+--------|
| Mon    |     2387 |        0 |       2387 |                         0 |   73.6 |
| Tu     |     2387 |        0 |       2387 |                         0 |   74.0 |
| Wed    |     2387 |          |       2387 |                         0 |        |
| Thu    |     2387 |          |       2387 |                         0 |        |
| Fri    |     2387 |        0 |       2387 |                         0 |        |
| Sat    |     2387 |        0 |       2387 |                         0 |        |
| Sun    |     2387 |        0 |       2387 |                         0 |        |
|--------+----------+----------+------------+---------------------------+--------|
| total  |    16709 |        0 |      16709 |                         0 |        |
#+TBLFM: $4=$2-$3::$5=$4-2387::@9$2..@9$5=vsum(@2..@8)


** wk2034 Calorie 
| wk2034 | intake total KC | exercise | Balance(b) | Calorie deficit(2387-(b)) | weight |
|--------+-----------------+----------+------------+---------------------------+--------|
| Mon    |            1510 |      920 |        590 |                     -1797 |   73.0 |
| Tu     |            2387 |        0 |       2387 |                         0 |        |
| Wed    |            2387 |          |       2387 |                         0 |        |
| Thu    |            2387 |          |       2387 |                         0 |        |
| Fri    |            2387 |        0 |       2387 |                         0 |        |
| Sat    |            2387 |        0 |       2387 |                         0 |        |
| Sun    |            2387 |        0 |       2387 |                         0 |        |
|--------+-----------------+----------+------------+---------------------------+--------|
| total  |           15832 |      920 |      14912 |                     -1797 |        |
#+TBLFM: $4=$2-$3::$5=$4-2387::@9$2..@9$5=vsum(@2..@8)

*** Calorie template
 | wk2033 | total KC | exercise | Balance(b) | Calorie deficit(2387-(b)) | weight |
 |--------+----------+----------+------------+---------------------------+--------|
 | Mon    |     2387 |        0 |       2387 |                         0 |        |
 | Tu     |     2387 |        0 |       2387 |                         0 |        |
 | Wed    |     2387 |          |       2387 |                         0 |        |
 | Thu    |     2387 |          |       2387 |                         0 |        |
 | Fri    |     2387 |        0 |       2387 |                         0 |        |
 | Sat    |     2387 |        0 |       2387 |                         0 |        |
 | Sun    |     2387 |        0 |       2387 |                         0 |        |
 |--------+----------+----------+------------+---------------------------+--------|
 | total  |    16709 |        0 |      16709 |                         0 |        |
 #+TBLFM: $4=$2-$3::$5=$4-2387::@9$2..@9$5=vsum(@2..@8)

 | best practices | morning running | morning weight training | night tennis | night power | total |
 |----------------+-----------------+-------------------------+--------------+-------------+-------|
 | example        |             720 |                     250 |          699 |         120 |  1789 |
 #+TBLFM: $6=vsum($2..$5)

** Exercise burnt Calorie per mins
 | mins | Run burn calorie | Burpee burnt calorie(9.4) |
 |------+------------------+---------------------------|
 |    1 |               12 |                         9 |
 |   30 |              360 |                       270 |
 |   60 |              720 |                       540 |
 |   80 |              960 |                       720 |
 |   90 |             1080 |                       810 |
 #+TBLFM: $3=9*$1

 20 burpee => burn 12.5KC
 1 burpee per 3 seconds

** Calorie in food
  | alcohol                                | calorie/100g |
  |----------------------------------------+--------------|
  | volka                                  |          230 |
  | beer                                   |         43.3 |
  | red wine                               |         82.9 |
  | chicken breast (no skin)               |          104 |
  | chicken inner muscle                   |          102 |
  | chinese omelette with tuna (per share) |          375 |
  | cola                                   |           42 |
  | dumpling                               |           45 |
  |                                        |              |
[[https://mall.pchome.com.tw/prod/CBAF27-A40498973][success_high_speed_jump_rope]]
[[https://shopee.tw/%E5%8F%B0%E7%81%A3%E7%8F%BE%E8%B2%A8-%E5%B0%88%E6%A5%AD%E6%88%90%E4%BA%BACrossfit%E6%88%B0%E9%AC%A5%E5%81%A5%E8%BA%AB%E8%BB%B8%E6%89%BF%E8%B7%B3%E7%B9%A9-%E9%8B%81%E5%90%88%E9%87%91%E6%9D%90%E8%B3%AA-%E7%94%B7%E5%A5%B3%E7%AB%B6%E9%80%9F%E6%AF%94%E8%B3%BD-%E8%80%83%E8%A9%A6%E7%94%A8-%E5%B0%88%E7%94%A8%E9%8B%BC%E7%B5%B2%E7%B9%A9-%E9%AB%98%E7%A9%A9%E5%AE%9A%E5%BA%A6-i.28111771.2067214582][high_speed_jump_rope]]

  Forehand + backhand + jump : 12 mins
 
  | item         | duration |
  |--------------+----------|
  | forehand     | 00:01:30 |
  | backhand     | 00:01:30 |
  | jumping jack | 00:01:30 |
  | serve        | 00:01:30 |
  |--------------+----------|
  | Total        | 00:06:00 |
  #+TBLFM: @6$2=vsum(@2$2..@5$2);T

   7700 / 2 / 7 = 550 KCperday, if I want to lose 0.5KG per week


